implementation 'com.google.firebase:firebase-messaging:23.4.0'
implementation 'com.google.firebase:firebase-analytics:21.5.0'

- Apply plugin:
apply plugin: 'com.google.gms.google-services'

---

### 3) CREATE FCM SERVICE

Create class: MyFirebaseMessagingService.kt

Requirements:
- Extend FirebaseMessagingService
- Override:
  - onNewToken(token)
  - onMessageReceived(remoteMessage)

Behavior:
- onNewToken:
  → POST token to backend `/save-token`
  → include user_id if available

- onMessageReceived:
  → show notification with NotificationCompat
  → use custom small icon (app icon)
  → support title, body, deep link (url)

---

### 4) NOTIFICATION CHANNEL (Android 8+)

- Create channel:
  - id: "amynest_default"
  - importance: HIGH
  - sound: default

---

### 5) MANIFEST CONFIG

- Add service:
<service android:name=".MyFirebaseMessagingService" android:exported="false">
<intent-filter>
<action android:name="com.google.firebase.MESSAGING_EVENT"/>
</intent-filter>
</service>

- Default notification icon:<meta-data android:name="com.google.firebase.messaging.default_notification_icon" android:resource="@mipmap/ic_launcher" />

---

### 6) TOKEN SYNC WITH WEB

In Web (PWA):

- Keep existing FCM Web (service worker)
- Save web token as `web_token`

In Android:

- Save native token as `android_token`

Backend schema:

---

### 6) TOKEN SYNC WITH WEB

In Web (PWA):

- Keep existing FCM Web (service worker)
- Save web token as `web_token`

In Android:

- Save native token as `android_token`

Backend schema:
{
user_id,
web_token,
android_token,
platform: "web" | "android"
}

---

### 7) BACKEND ROUTING (CRITICAL)

When sending push:

IF android_token exists:
  → send via FCM native

ELSE IF web_token exists:
  → send via FCM web push

---

### 8) PAYLOAD FORMAT

Send unified payload:
{
"title": "Dinner Time 🍽️",
"body": "Healthy meal ready",
"url": "/routine"
}

Android:
- open URL in TWA

Web:
- service worker handles click

---

### 9) DEEP LINK HANDLING

On notification click:

- Open TWA with URL:
  https://amynest.in/{path}

---

### 10) FALLBACK

If Android app not installed:
→ Web push works normally

---

### 11) TESTING

- Install APK
- Allow notification
- Verify token saved
- Send test push:
  → should show native notification (no Chrome icon)

---

### 12) SUCCESS CRITERIA

- Native push works without Chrome branding
- Web push still works
- Same backend handles both